{
  "id": "1758480783492",
  "type": 1,
  "typeName": "Product Release Video",
  "userInput": "Brands just got a powerful new tool to increase their customer engagement and expand brand equity, no app required. Rich Communication Services (RCS) is now generally available, bringing trusted, rich conversations that bring precise engagement to your customer communication toolkit. The messaging industry has been buzzing for the past year about the arrival of RCS and what it means for interacting with consumers. In a world where every business is vying for consumer attention and trust matters more than ever, RCS business messaging will change business communications as we know it.\n\nCan a messaging channel really make that big of an impact? The short answer is… yes. RCS introduces revolutionary functionality to A2P texting for both brands and consumers. Consumers get to experience a new way of texting a brand. Instead of 160 characters of text and an unknown number, they can interact with a verified and branded sender filled with rich functionality that builds trust directly into every interaction. 88% of consumers who received a message with a verification badge reported increased trust. On the business side, brands are able to increase their engagement through a channel that brings their branding directly to a customer’s lock screen, builds customer loyalty, and drives action.\n\nCustomers’ increased engagement comes from an additional layer of verification and branding, and rich interactions like quick reply buttons, clickable image carousels, and more that just aren’t possible with SMS. Nova Gestões, a credit recovery org based in Brazil, gravitated toward RCS to help customers connect quickly through a trusted texting experience and saw instant results.\n\n\n\"RCS through Twilio has transformed how we engage with our customers. With RCS, we’ve seen a 4x improvement in response rates compared to SMS.\"\n\n- Juliano Skrzyszowski, Nova Gestões, CTO\n\nIf you want to dive into what RCS can do, here are 6 things to know about RCS. However, if you have already decided to jump on the RCS bandwagon, read on to learn about how we’ve invested in our platform to seamlessly integrate RCS into your current messaging solution.\n\nBuilt for builders: Integrate with zero code changes and no new API\nAnother channel doesn’t have to mean more work. We’ve prioritized the builder experience so you can adopt RCS without introducing technical debt. From onboarding to managing rich content and monitoring your entire messaging solution at scale, Twilio has tailored this experience to make builders’ lives easier, and here is how:\n\nUpgrade with zero code changes: If you’re already using Twilio’s Programmable Messaging API, you can enable RCS on your existing Messaging Services—no new APIs or SDKs required. Manage SMS, MMS, WhatsApp, and RCS through a single endpoint architecture. This also means no new developers are needed, no never-ending engineering sprints, and no new code to maintain.\nBuild rich content once and deploy across all messaging channels: Typically, engineers need to build individual messaging workflows to manage their rich content across channels since each channel has different capabilities and protocols. To simplify message functionality across channels, our Content Template Builder supports both API and UI workflows. You can build rich content for RCS once—images, videos, quick replies, carousels—and deploy it across channels while also implementing automatic fall back to SMS/MMS or WhatsApp to ensure that your message is always delivered. RCS is a growing channel and is available in 22 countries as of August 2025. This means that implementing SMS/MMS or WhatsApp fallback is essential to message deliverability as RCS continues to expand.\nMonitor and troubleshoot with traffic insights, data, and AI: Our Messaging Insights provides out-of-the-box dashboards across channels, so you can compare performance for SMS, MMS, WhatsApp, and RCS in one place. RCS adds critical engagement metrics, including read receipts and clicks available through webhooks, fueling A/B testing and optimization. You can tie messaging campaigns directly to engagement, loyalty, and revenue outcomes, and give your leadership the visibility they need to scale investment with confidence.\n\nBuilding for real-world interactions\nRCS isn't just a replacement for SMS; it unlocks entirely new use cases for your business. Rich features help brands design immersive journeys that drive actions like visual product discovery via carousels, frictionless service updates with quick replies, and secure document delivery via PDFs.\n\nWoman with suitcase looking out hotel room window with bed and text about luxury stay at Owl Hotels.\nWith RCS added to your messaging toolkit, the options of how to implement and innovate are endless. Here are a few use cases we’ve seen that can get your mind moving:\n\nSales & promotions\nBoost urgency and clicks by showcasing limited-time offers through rich content cards, carousels, and CTA buttons. Integrate RCS webviews to keep the purchasing experience within the customer’s native messaging app.\n\nAppointment Reminders\nEngage with your customers through a branded experience and integrate suggested replies directly into your messages to decrease missed appointments and reduce operational costs.\n\nWith Twilio’s seamless API, Fresha deployed RCS with no code changes, achieving standout results compared to SMS:\n\nHigher engagement: Appointment-related RCS messages achieved a 41.3% read rate.\nIncreased confirmations: There was a 6% increase in customers confirming their appointments\nPost-appointment growth: The interactive prompts led to a 7.1% jump in customer reviews and a 5.3% increase in tipping, directly boosting partner revenue.\nSuperior deliverability: RCS messages reached a 99.2% delivery rate, ensuring critical communications were consistently received.\nFraud alerts\nBuild a trusted messaging interaction for customers by sending fraud alerts from your branded RCS sender with suggested reply buttons to expedite the time to resolution.\n\nProduct discovery carousels\nCreate two-way purchasing conversations with your customers and inspire purchases with dynamic product carousels with clickable links personalized seamlessly by combining RCS with your CDP to deliver experiences tailored to each user’s preferences.\n\nSmartphone screen showing a text message promoting sun hats for beach trips.\nDelivery support\nUplevel your customer and product support experience with two-way, branded RCS messages. Lowe’s has drastically improved their shipments and delivery success by implementing a two-way RCS conversation to ensure the homeowner, construction manager, or builder is available for a delivery before the trucks leave the store. This reduces re-delivery, decreasing logistical cost, and creates a more engaging and trusted experience with the Lowe’s brand.\n\nOnboarding onto RCS: What you can do today\nHead over to the Twilio Console for a UI-based sender creation and approval flow to help you register, verify, and launch RCS faster. You’ll also be able to build and prototype immediately within our UI builder to test out rich features and experiment with how your brand is showcased through RCS messages. While ecosystem vetting and carrier approvals remain manual for RCS across the industry, we automate everything we can and surface clear statuses and next steps to expedite the onboarding experience.",
  "createdAt": "2025-09-21T11:53:03.496865",
  "storyboard": null
}